Repository: ahmednour/givingbridge2
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Giving Bridge
ar: جسر العطاء

source: Welcome Back
ar: مرحباً بعودتك

source: Sign In
ar: تسجيل الدخول

source: Sign up
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Name
ar: الاسم

source: Phone
ar: الهاتف

source: Location
ar: الموقع

source: Logout
ar: تسجيل الخروج

source: Dashboard
ar: لوحة التحكم

source: My Donations
ar: تبرعاتي

source: Browse Donations
ar: تصفح التبرعات

source: My Requests
ar: طلباتي

source: Incoming Requests
ar: الطلبات الواردة

source: Browse Requests
ar: تصفح الطلبات

source: Messages
ar: الرسائل

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Create Donation
ar: إنشاء تبرع

source: Title
ar: العنوان

source: Description
ar: الوصف

source: Category
ar: الفئة

source: Condition
ar: الحالة

source: Submit
ar: إرسال

source: Cancel
ar: إلغاء

source: Approve
ar: قبول

source: Decline
ar: رفض

source: Request
ar: طلب

source: Message
ar: رسالة

source: Send
ar: إرسال

source: Search
ar: بحث

source: Filter
ar: تصفية

source: All
ar: الكل

source: Food
ar: طعام

source: Clothes
ar: ملابس

source: Books
ar: كتب

source: Electronics
ar: إلكترونيات

source: Furniture
ar: أثاث

source: Toys
ar: ألعاب

source: Other
ar: أخرى

source: Pending
ar: قيد الانتظار

source: Approved
ar: مقبول

source: Declined
ar: مرفوض

source: Completed
ar: مكتمل

source: Cancelled
ar: ملغي

source: Donor
ar: متبرع

source: Receiver
ar: مستقبل

source: Admin
ar: مدير

source: Users
ar: المستخدمون

source: Donations
ar: التبرعات

# donationCreated
source: Donation created successfully
ar: تم إنشاء التبرع بنجاح

# donationUpdated
source: Donation updated successfully
ar: تم تحديث التبرع بنجاح

source: Edit Donation
ar: تعديل التبرع

source: Previous
ar: السابق

source: Donation Details
ar: تفاصيل التبرع

# basicInfoDescription
source: Provide basic information about your donation
ar: قدم معلومات أساسية عن تبرعك

# donationTitle
source: Donation
ar: عنوان التبرع

# donationTitleHint
source: Enter a descriptive title for your donation
ar: أدخل عنواناً وصفياً لتبرعك

# requiredField
source: This field is required
ar: هذا الحقل مطلوب

# titleTooShort
source: Title must be at least 3 characters long
ar: العنوان قصير جداً (3 أحرف على الأقل)

# donationDescription
source: Description
ar: الوصف

# donationDescriptionHint
source: Describe your donation in detail
ar: صف تبرعك بالتفصيل

# descriptionTooShort
source: Description must be at least 10 characters long
ar: الوصف قصير جداً (10 أحرف على الأقل)

# donationLocation
source: Location
ar: الموقع

# donationLocationHint
source: Enter the location where the donation is available
ar: أدخل الموقع الذي يتوفر فيه التبرع

# locationTooShort
source: Location must be at least 2 characters long
ar: الموقع قصير جداً (حرفان على الأقل)

source: Quantity
ar: الكمية

# quantityHint
source: Enter the number of items
ar: أدخل عدد العناصر

# invalidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

# invalidPhone
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صحيح

# passwordTooShort
source: Password must be at least 6 characters
ar: كلمة المرور قصيرة جداً (6 أحرف على الأقل)

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# invalidQuantity
source: Please enter a valid quantity (minimum 1)
ar: الرجاء إدخال كمية صحيحة (1 على الأقل)

source: Notes
ar: ملاحظات

# notesHint
source: Additional information (optional)
ar: معلومات إضافية (اختياري)

# categoryAndCondition
source: Category & Condition
ar: الفئة والحالة

# categoryDescription
source: Select the appropriate category and condition for your donation
ar: حدد الفئة والحالة المناسبة لتبرعك

# donationCategory
source: Category
ar: الفئة

source: Requests
ar: الطلبات

source: Analytics
ar: التحليلات

source: Available
ar: متاح

source: Unavailable
ar: غير متاح

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Save
ar: حفظ

source: Close
ar: إغلاق

source: Yes
ar: نعم

source: No
ar: لا

source: Loading...
ar: جارٍ التحميل...

source: Error
ar: خطأ

source: Success
ar: نجح

# connectingHearts
source: Connecting hearts, changing lives
ar: نربط القلوب، نغير الحياة

source: No data available
ar: لا توجد بيانات متاحة

source: Donation Images
ar: صور التبرع

# imagesDescription
source: Add photos to showcase your donation
ar: أضف صوراً لعرض تبرعك

source: Add Images
ar: إضافة صور

source: Select from Gallery
ar: اختر من المعرض

source: Take Photo
ar: التقط صورة

source: Selected Images
ar: الصور المختارة

source: Review Donation
ar: مراجعة التبرع

# reviewDescription
source: Review your donation details before submitting
ar: راجع تفاصيل تبرعك قبل الإرسال

source: images
ar: صور

source: Update Donation
ar: تحديث التبرع

source: Mark All as Read
ar: وضع علامة مقروء على الكل

source: Message Settings
ar: إعدادات الرسائل

source: Archived Conversations
ar: المحادثات المؤرشفة

source: Blocked Users
ar: المستخدمون المحظورون

source: Search Messages
ar: بحث في الرسائل

source: Unread
ar: غير مقروء

source: Loading messages...
ar: جارٍ تحميل الرسائل...

source: No Messages
ar: لا توجد رسائل

# noMessagesDescription
source: Start a conversation to connect with others
ar: ابدأ محادثة للتواصل مع الآخرين

source: Start Conversation
ar: بدء محادثة

source: About Donation
ar: حول التبرع

source: About Request
ar: حول الطلب

source: New Conversation - Coming Soon
ar: محادثة جديدة - قريباً

source: Message Settings - Coming Soon
ar: إعدادات الرسائل - قريباً

source: Archived Conversations - Coming Soon
ar: المحادثات المؤرشفة - قريباً

source: Blocked Users - Coming Soon
ar: المستخدمون المحظورون - قريباً

source: Notifications
ar: الإشعارات

source: Privacy
ar: الخصوصية

source: Message History
ar: سجل الرسائل

source: Sound
ar: الصوت

source: Play sound for messages
ar: تشغيل الصوت للرسائل

source: Vibration
ar: الاهتزاز

source: Vibrate for messages
ar: الاهتزاز للرسائل

source: Read Receipts
ar: إشعارات القراءة

# showReadReceipts
source: Show when messages are read
ar: عرض وقت قراءة الرسائل

source: Typing Indicators
ar: مؤشرات الكتابة

# showTypingIndicators
source: Show when others are typing
ar: عرض وقت كتابة الآخرين

source: Auto-delete Messages
ar: حذف تلقائي للرسائل

source: Automatically delete old messages
ar: حذف الرسائل القديمة تلقائياً

source: Setting updated
ar: تم تحديث الإعداد

source: No archived conversations
ar: لا توجد محادثات مؤرشفة

# noArchivedConversationsDescription
source: Your archived conversations will appear here
ar: ستظهر محادثاتك المؤرشفة هنا

source: Unarchive
ar: إلغاء الأرشفة

source: Next
ar: التالي

source: Try Again
ar: حاول مرة أخرى

source: User Management
ar: إدارة المستخدمين

source: Donation Management
ar: إدارة التبرعات

source: Request Management
ar: إدارة الطلبات

source: Total Users
ar: إجمالي المستخدمين

source: Total Donations
ar: إجمالي التبرعات

source: Total Requests
ar: إجمالي الطلبات

source: Active Users
ar: المستخدمون النشطون

source: Add Image
ar: إضافة صورة

source: Select Image Source
ar: اختر مصدر الصورة

source: Offline Mode
ar: وضع عدم الاتصال

source: Retry
ar: إعادة المحاولة

source: Something went wrong
ar: حدث خطأ ما

source: Go Back
ar: عودة

source: Sync Now
ar: مزامنة الآن

source: Dismiss
ar: تجاهل

# pendingOperations
source: {count, plural, =0{No pending operations} =1{1 pending operation} other{{count} pending operations}}
ar: {count, plural, =0{لا توجد عمليات معلقة} =1{عملية واحدة معلقة} other{{count} عمليات معلقة}}

source: Login
ar: تسجيل الدخول

source: Get Started
ar: ابدأ الآن

source: Connect Hearts, Share Hope
ar: نربط القلوب،نشارك الأمل

# landingHeroDescription
source: Giving Bridge connects generous donors with those in need, creating a community where kindness flows freely and every donation makes a real difference.
ar: جسر العطاء يربط المتبرعين السخيين بالمحتاجين، مما يخلق مجتمعاً حيث يتدفق اللطف بحرية وكل تبرع يُحدث فرقاً حقيقياً.

# startDonating
source: Start donating to see your impact!
ar: ابدأ التبرع

source: Learn More
ar: اعرف المزيد

source: Beautiful Illustration Coming Soon
ar: رسم توضيحي جميل قريباً

source: Why Choose Giving Bridge?
ar: لماذا تختار جسر العطاء؟

# platformDescription
source: Our platform makes giving and receiving simple, safe, and meaningful.
ar: منصتنا تجعل العطاء والاستلام بسيطاً وآمناً وذا معنى.

source: Easy Donations
ar: تبرعات سهلة

# easyDonationsDesc
source: Simple and secure way to donate items to those who need them most.
ar: طريقة بسيطة وآمنة للتبرع بالأشياء لمن يحتاجها أكثر.

source: Smart Matching
ar: مطابقة ذكية

# smartMatchingDesc
source: Our platform intelligently connects donors with receivers based on location and needs.
ar: منصتنا تربط المتبرعين بالمستقبلين بذكاء بناءً على الموقع والاحتياجات.

source: Verified Users
ar: مستخدمون موثقون

# verifiedUsersDesc
source: All users are verified to ensure safe and trustworthy transactions.
ar: جميع المستخدمين موثقون لضمان معاملات آمنة وموثوقة.

source: Impact Tracking
ar: تتبع التأثير

# impactTrackingDesc
source: Track your donations and see the real impact you're making in your community.
ar: تتبع تبرعاتك وشاهد التأثير الحقيقي الذي تحدثه في مجتمعك.

source: How It Works
ar: كيف يعمل

# stepSignUp
source: Sign Up
ar: سجل

# stepSignUpDesc
source: Create your account as a donor or receiver in just a few clicks.
ar: أنشئ حسابك كمتبرع أو مستقبل في بضع نقرات فقط.

# stepBrowseOrPost
source: Browse or Post
ar: تصفح أو انشر

# stepBrowseOrPostDesc
source: Donors post items, receivers browse available donations.
ar: ينشر المتبرعون العناصر، ويتصفح المستقبلون التبرعات المتاحة.

# stepConnect
source: Connect
ar: تواصل

# stepConnectDesc
source: Get matched with verified users in your community.
ar: احصل على مطابقة مع مستخدمين موثقين في مجتمعك.

# stepShareReceive
source: Share & Receive
ar: شارك واستلم

# stepShareReceiveDesc
source: Complete the donation and make a positive impact together.
ar: أكمل التبرع واصنع تأثيراً إيجابياً معاً.

source: Our Impact in Numbers
ar: تأثيرنا بالأرقام

source: Items Donated
ar: عناصر متبرع بها

source: Happy Recipients
ar: مستلمون سعداء

source: Cities Covered
ar: مدن مغطاة

source: Success Rate
ar: معدل النجاح

source: Ready to Make a Difference?
ar: هل أنت مستعد لإحداث فرق؟

# joinThousands
source: Join thousands of people who are already making their communities better, one donation at a time.
ar: انضم إلى الآلاف من الأشخاص الذين يجعلون مجتمعاتهم أفضل، تبرع واحد في كل مرة.

# browseDonationsAction
source: Browse Donations
ar: تصفح التبرعات

# copyright
source: © 2025 Giving Bridge. All rights reserved.
ar: © 2025 جسر العطاء. جميع الحقوق محفوظة.

source: Failed to update setting
ar: فشل تحديث الإعداد

source: Create Request
ar: إنشاء طلب

source: Reports
ar: التقارير

source: Manage Account
ar: إدارة الحساب

source: Chat with Users
ar: الدردشة مع المستخدمين

source: Manage Alerts
ar: إدارة التنبيهات

source: Help & Support
ar: المساعدة والدعم

source: Get Assistance
ar: الحصول على المساعدة

source: Search donations...
ar: البحث في التبرعات...

# madeWithLove
source: Made with ❤️ for communities worldwide
ar: صنع بـ ❤️ للمجتمعات في جميع أنحاء العالم

# errorOccurred
source: An error occurred
ar: حدث خطأ

# pleaseCheckConnection
source: Please check your connection and try again
ar: يرجى التحقق من اتصالك والمحاولة مرة أخرى

source: Confirm
ar: تأكيد

source: Role
ar: الدور

# selectRole
source: Select your role
ar: اختر دورك

source: Confirm Password
ar: تأكيد كلمة المرور

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# welcomeUser
source: Welcome to Giving Bridge, {name}!
ar: مرحباً بك في جسر العطاء، {name}!

source: Avatar upload coming soon!
ar: رفع الصورة الشخصية قريباً!

source: Save Changes
ar: حفظ التغييرات

source: Notification settings coming soon!
ar: إعدادات الإشعارات قريباً!

source: Language settings coming soon
ar: إعدادات اللغة قريباً!

source: Help & Support - Coming Soon
ar: المساعدة والدعم قريباً!

# selectLanguage
source: Select Language / اختر اللغة
ar: اختر اللغة

source: Overview
ar: نظرة عامة

source: Good morning
ar: صباح الخير

source: Good afternoon
ar: مساء الخير

source: Good evening
ar: مساء الخير

# thankYouDifference
source: Thank you for making a difference
ar: شكراً لك على إحداث فرق

source: Active
ar: نشط

source: Impact Score
ar: نقاط التأثير

source: Recent Donations
ar: التبرعات الأخيرة

source: View All
ar: عرض الكل

source: Quick Actions
ar: إجراءات سريعة

# shareItemsNeed
source: Share items with those in need
ar: شارك العناصر مع المحتاجين

source: See what people need
ar: انظر ما يحتاجه الناس

source: View Impact
ar: عرض التأثير

# seeContributionStats
source: See your contribution stats
ar: شاهد إحصائيات مساهمتك

# newButton
source: New
ar: جديد

source: No donations yet
ar: لا توجد تبرعات بعد

# startMakingDifference
source: Start making a difference by creating your first donation
ar: ابدأ في إحداث فرق من خلال إنشاء تبرعك الأول

source: Create First Donation
ar: إنشاء أول تبرع

source: Delete Donation
ar: حذف التبرع

# deleteDonationConfirm
source: Are you sure you want to delete this donation?
ar: هل أنت متأكد من أنك تريد حذف هذا التبرع؟

# donationDeletedSuccess
source: Donation deleted successfully!
ar: تم حذف التبرع بنجاح!

# discoverItems
source: Discover items that can help you
ar: اكتشف العناصر التي يمكن أن تساعدك

source: Available Items
ar: العناصر المتاحة

source: Approved Requests
ar: الطلبات المقبولة

# requestSentSuccess
source: Request sent successfully!
ar: تم إرسال الطلب بنجاح!

source: Request Donation
ar: طلب تبرع

source: Send Request
ar: إرسال الطلب

# welcomeAdmin
source: Welcome, {name}!
ar: مرحباً، {name}!

# manageOversee
source: Manage and oversee the GivingBridge platform
ar: إدارة والإشراف على منصة جسر العطاء

source: Platform Statistics
ar: إحصائيات المنصة

source: Active Items
ar: العناصر النشطة

source: Donation Categories
ar: فئات التبرعات

source: Request Status
ar: حالة الطلب

# noDonations
source: No donations yet
ar: لا توجد تبرعات بعد

# noRequests
source: No requests yet
ar: لا توجد طلبات بعد

source: Featured Donations
ar: التبرعات المميزة

# featuredDonationsDesc
source: See what people are sharing in our community
ar: شاهد ما يشاركه الناس في مجتمعنا

source: View All Donations
ar: عرض جميع التبرعات

# newLabel
source: New
ar: جديد

# availableLabel
source: Available
ar: متاح

# donatedBy
source: Donated by {name}
ar: تبرع من {name}

# joinCommunity
source: Join our community to make a difference
ar: انضم إلى مجتمعنا لإحداث فرق

source: Decline Request
ar: رفض الطلب

source: Approve Request
ar: قبول الطلب

source: Approval Message
ar: رسالة القبول

# provideDeclineReason
source: Please provide a reason for declining (optional)...
ar: يرجى تقديم سبب للرفض (اختياري)...

# provideApprovalMessage
source: Add a message for the receiver (optional)...
ar: أضف رسالة للمستلم (اختياري)...

# responseMessageHint
source: Enter your message here...
ar: أدخل رسالتك هنا...

# requestUpdatedSuccess
source: Request updated successfully!
ar: تم تحديث الطلب بنجاح!

source: Failed to update request
ar: فشل تحديث الطلب

source: Network error
ar: خطأ في الشبكة

source: Failed to load requests
ar: فشل تحميل الطلبات

source: No requests found
ar: لا توجد طلبات

# noRequestsDescription
source: You don't have any requests matching the selected filter.
ar: ليس لديك أي طلبات تطابق الفلتر المحدد.

# respondedAt
source: Responded
ar: تم الرد

# requestedAt
source: Requested
ar: تم الطلب

source: Mark all read
ar: وضع علامة مقروء على الكل

# unreadNotifications
source: {count} unread notifications
ar: {count} إشعارات غير مقروءة

source: No notifications
ar: لا توجد إشعارات

# allCaughtUp
source: You're all caught up!
ar: لقد قرأت كل شيء!

source: Just now
ar: الآن

source: minutes ago
ar: دقائق مضت

source: hours ago
ar: ساعات مضت

# daysAgo
source: {days}d ago
ar: {days} ي

source: Mark as read
ar: وضع علامة مقروء

source: Notification Settings
ar: إعدادات الإشعارات

source: Push Notifications
ar: الإشعارات الفورية

source: Donation Requests
ar: طلبات التبرع

# notifyDonationRequests
source: Get notified when someone requests your donations
ar: احصل على إشعار عندما يطلب شخص ما تبرعاتك

source: New Donations
ar: تبرعات جديدة

# notifyNewDonations
source: Get notified about new donations in your area
ar: احصل على إشعار حول التبرعات الجديدة في منطقتك

source: Status Updates
ar: تحديثات الحالة

# notifyStatusUpdates
source: Get notified about donation status changes
ar: احصل على إشعار حول تغييرات حالة التبرع

source: Reminders
ar: التذكيرات

# notifyReminders
source: Get reminded about pickup times and deadlines
ar: احصل على تذكير بأوقات الاستلام والمواعيد النهائية

source: Email Notifications
ar: إشعارات البريد الإلكتروني

source: Weekly Summary
ar: ملخص أسبوعي

# receiveWeeklySummary
source: Receive a weekly summary of your activity
ar: احصل على ملخص أسبوعي لنشاطك

source: Important Updates
ar: تحديثات مهمة

# receiveImportantUpdates
source: Receive important platform updates
ar: احصل على تحديثات مهمة للمنصة

source: Marketing Emails
ar: رسائل التسويق

# receiveMarketingEmails
source: Receive tips and feature announcements
ar: احصل على نصائح وإعلانات عن الميزات

source: Clear All Notifications
ar: مسح كل الإشعارات

source: Enabled
ar: مُفعّل

source: Disabled
ar: معطل

# allNotificationsRead
source: All notifications marked as read
ar: تم وضع علامة مقروء على جميع الإشعارات

source: Notification deleted
ar: تم حذف الإشعار

# clearAllConfirm
source: Are you sure you want to clear all notifications? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد مسح جميع الإشعارات؟ لا يمكن التراجع عن هذا الإجراء.

source: All notifications cleared
ar: تم مسح جميع الإشعارات

source: Notifications refreshed
ar: تم تحديث الإشعارات

# newDonationRequest
source: New donation request submitted
ar: تم تقديم طلب تبرع جديد

source: Donation approved!
ar: تم قبول التبرع!

source: Pickup reminder
ar: تذكير بالاستلام

source: Donation completed
ar: تم إكمال التبرع

source: New donation available
ar: تبرع جديد متاح

source: Clear All
ar: مسح الكل

source: Cancel Request
ar: إلغاء الطلب

# cancelRequestConfirm
source: Are you sure you want to cancel this request?
ar: هل أنت متأكد من أنك تريد إلغاء هذا الطلب؟

# yesCancelRequest
source: Yes, Cancel
ar: نعم، إلغاء

# haveReceivedDonation
source: Have you received this donation?
ar: هل استلمت هذا التبرع؟

source: Not Yet
ar: ليس بعد

# requestCancelled
source: Request cancelled successfully
ar: تم إلغاء الطلب بنجاح

# requestMarkedCompleted
source: Request marked as completed
ar: تم وضع علامة مكتمل على الطلب

source: Failed to cancel request
ar: فشل إلغاء الطلب

source: Failed to complete request
ar: فشل إكمال الطلب

# profileUpdatedSuccess
source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

source: Failed to update profile
ar: فشل تحديث الملف الشخصي

# logoutConfirm
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

source: English
ar: الإنجليزية

# deleteAction
source: Delete
ar: حذف

source: Block User
ar: حظر المستخدم

source: Report User
ar: الإبلاغ عن المستخدم

# deleteConfirm
source: Are you sure you want to delete this user?
ar: هل أنت متأكد من أنك تريد حذف هذا المستخدم؟

source: OK
ar: موافق

# noRouteDefined
source: No route defined for
ar: لم يتم تحديد مسار لـ

source: Secure Platform
ar: منصة آمنة

# securePlatformDesc
source: End-to-end encryption and secure payment processing for your peace of mind.
ar: تشفير شامل ومعالجة دفع آمنة لراحة بالك.

# support247
source: 24/7 Support
ar: دعم على مدار الساعة

# support247Desc
source: Our dedicated support team is always ready to help you make a difference.
ar: فريق الدعم المخصص لدينا جاهز دائمًا لمساعدتك في إحداث فرق.

# simpleSteps
source: Simple steps to make a difference
ar: خطوات بسيطة لإحداث فرق

# whatCommunitySays
source: What Our Community Says
ar: ماذا يقول مجتمعنا

# realStories
source: Real stories from donors and receivers who make a difference every day
ar: قصص حقيقية من المتبرعين والمستقبلين الذين يحدثون فرقًا كل يوم

# testimonial1Text
source: After losing my business due to the pandemic, I found myself needing help. Within 2 days, a donor provided groceries for my family. Now that I'm back on my feet, I donate regularly to pay it forward. This platform saved us.
ar: بعد خسارة عملي بسبب الوباء، وجدت نفسي بحاجة للمساعدة. في غضون يومين، قدم متبرع البقالة لعائلتي. الآن بعد أن عدت إلى قدمي، أتبرع بانتظام لرد الجميل. هذه المنصة أنقذتنا.

# testimonial2Text
source: I coordinate donations for my neighborhood. GivingBridge streamlined everything - from posting requests to tracking deliveries. We've helped 23 families this year alone. The impact is real and measurable.
ar: أنسق التبرعات لحيي. جعلت جيفينج بريدج كل شيء أبسط - من نشر الطلبات إلى تتبع التسليمات. ساعدنا 23 عائلة هذا العام وحده. التأثير حقيقي وقابل للقياس.

# testimonial3Text
source: As a single mother working two jobs, affording school supplies was tough. Through GivingBridge, my kids got books, a laptop, and clothes. The donors were respectful and kind. This platform is a blessing.
ar: كأم عزباء تعمل في وظيفتين، كان تحمل تكاليف اللوازم المدرسية صعبًا. من خلال جيفينج بريدج، حصل أطفالي على الكتب وجهاز كمبيوتر محمول وملابس. كان المتبرعون محترمين ولطفاء. هذه المنصة نعمة.

source: Enter your name
ar: أدخل اسمك

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Enter your password
ar: أدخل كلمة المرور

# enterYourPhone
source: Enter your phone number
ar: أدخل رقم هاتفك

source: Enter your location
ar: أدخل موقعك

source: (Optional)
ar: (اختياري)

source: Please enter your name
ar: يرجى إدخال اسمك

# pleaseFillRequiredFields
source: Please fill in all required fields correctly
ar: يرجى ملء جميع الحقول المطلوبة بشكل صحيح

source: Requests for my donations
ar: طلبات تبرعاتي

# noIncomingRequests
source: No incoming requests yet
ar: لا توجد طلبات واردة بعد

# whenReceiversRequest
source: When receivers request your donations, they will appear here
ar: عندما يطلب المستقبلون تبرعاتك، ستظهر هنا

source: Request from
ar: {name}طلب من

source: Requested on
ar: تم الطلب في

source: My Impact
ar: تأثيري

source: Contribution Statistics
ar: إحصائيات المساهمة

source: Total Donations Made
ar: إجمالي التبرعات المقدمة

source: Active Donations
ar: التبرعات النشطة

source: Completed Donations
ar: التبرعات المكتملة

source: People Helped
ar: الأشخاص الذين تمت مساعدتهم

source: Pending Requests
ar: الطلبات المعلقة

source: Impact Over Time
ar: التأثير عبر الزمن

source: This Month
ar: هذا الشهر

source: This Year
ar: هذا العام

source: All Time
ar: طوال الوقت

source: Category Breakdown
ar: التوزيع حسب الفئة

source: Recent Activity
ar: النشاط الأخير

source: View details
ar: عرض التفاصيل

source: No activity yet
ar: لا يوجد نشاط بعد

source: Request Details
ar: تفاصيل الطلب

source: Requester
ar: الطالب

source: Contact Requester
ar: الاتصال بالطالب

source: Mark as Completed
ar: وضع علامة كمكتمل

source: Statistics
ar: الإحصائيات

# requestApproved
source: Request approved successfully
ar: تم قبول الطلب بنجاح

source: Request declined
ar: تم رفض الطلب

source: Communities
ar: المجتمعات

source: Active Donors
ar: المتبرعين النشطين

source: donations today
ar: تبرعات اليوم

# peopleHelpedCount
source: people helped
ar: أشخاص تم مساعدتهم

source: Secure 100%
ar: آمن 100%

# popularBadge
source: 🔥 Popular
ar: 🔥 شائع

# newCommunities
source: +3 new
ar: +3 جديدة

# trustedBadge
source: Trusted
ar: موثوق

# aiPoweredBadge
source: ✨ AI Powered
ar: ✨ مدعوم بالذكاء الاصطناعي

# verifiedBadge
source: ✓ Verified
ar: ✓ موثق

# realtimeBadge
source: 📊 Real-time
ar: 📊 في الوقت الفعلي

# secureBadge
source: 🔒 Secure
ar: 🔒 آمن

# supportBadge
source: 🆘 24/7 Support
ar: 🆘 دعم 24/7

# newBadge
source: 🆕 New
ar: 🆕 جديد

# receiveDonationNotifications
source: Receive notifications about donations
ar: تلقي إشعارات حول التبرعات
