Repository: ahmednour/givingbridge2
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

# receiveEmailUpdates
source: Receive email updates about your activity
ar: تلقي تحديثات البريد الإلكتروني حول نشاطك

# notifyOnNewRequests
source: Notify when your donations are requested
ar: الإشعار عند طلب تبرعاتك

source: Donation Approvals
ar: موافقات التبرع

# notifyOnApprovals
source: Notify when your donation requests are approved
ar: الإشعار عند الموافقة على طلبات التبرع

# notifyOnNewMessages
source: Notify when you receive new messages
ar: الإشعار عند تلقي رسائل جديدة

source: System Updates
ar: تحديثات النظام

# notifyOnSystemUpdates
source: Notify about app updates and maintenance
ar: الإشعار حول تحديثات التطبيق والصيانة

# manageYourNotifications
source: Manage your notification preferences
ar: إدارة تفضيلات الإشعارات

source: All Notifications
ar: جميع الإشعارات

source: Turn on all notifications
ar: تشغيل جميع الإشعارات

source: Language
ar: اللغة

source: Change app language
ar: تغيير لغة التطبيق

# languageChanged
source: Language changed successfully
ar: تم تغيير اللغة بنجاح

# selectLanguagePrompt
source: Select your preferred language
ar: اختر لغتك المفضلة

source: Current Language
ar: اللغة الحالية

source: Medical
ar: طبي

source: Education
ar: تعليم

source: Housing
ar: إسكان

source: Emergency
ar: طوارئ

source: Healthcare
ar: رعاية صحية

source: Childcare
ar: رعاية الأطفال

source: Eldercare
ar: رعاية المسنين

source: Transportation
ar: نقل

source: Utilities
ar: مرافق

source: Clothing
ar: ملابس

source: School Supplies
ar: لوازم مدرسية

source: Medical Supplies
ar: لوازم طبية

source: Baby Items
ar: مستلزمات الأطفال

source: Kitchenware
ar: أدوات المطبخ

source: Bedding
ar: أغطية السرير

source: Personal Care
ar: العناية الشخصية

source: Cleaning
ar: تنظيف

source: Sports
ar: رياضة

source: Hobbies
ar: هوايات

source: Pet Supplies
ar: مستلزمات الحيوانات الأليفة

# categoryMedical
source: Medical
ar: طبي

# categoryEducation
source: Education
ar: تعليم

# categoryFood
source: Food
ar: طعام

# categoryHousing
source: Housing
ar: إسكان

# categoryEmergency
source: Emergency
ar: طوارئ

# categoryClothing
source: Clothing
ar: ملابس

# categoryBooks
source: Books
ar: كتب

# categoryElectronics
source: Electronics
ar: إلكترونيات

# categoryFurniture
source: Furniture
ar: أثاث

# categoryToys
source: Toys
ar: ألعاب

# categoryOther
source: Other
ar: أخرى

# medicalDescription
source: Medical supplies, medications, and health equipment
ar: مستلزمات طبية وأدوية ومعدات صحية

# educationDescription
source: School books, educational supplies, and study materials
ar: كتب مدرسية ولوازم تعليمية ومواد دراسية

# foodDescription
source: Food, groceries, and ready meals
ar: طعام ومواد غذائية ووجبات جاهزة

# housingDescription
source: Home furniture and housing supplies
ar: أثاث منزلي ومستلزمات السكن

# emergencyDescription
source: Urgent aid and emergency supplies
ar: مساعدات عاجلة وإمدادات طوارئ

# clothingDescription
source: Clothes, shoes, and accessories
ar: ملابس وأحذية وإكسسوارات

# booksDescription
source: Books, magazines, and reading materials
ar: كتب ومجلات ومواد قراءة

# electronicsDescription
source: Electronic devices and technology
ar: أجهزة إلكترونية وتقنية

# furnitureDescription
source: Home and office furniture
ar: أثاث منزلي ومكتبي

# toysDescription
source: Toys and entertainment for children
ar: ألعاب وترفيه للأطفال

# otherDescription
source: Other miscellaneous items
ar: عناصر أخرى متنوعة

# donationForMedical
source: Medical Donation
ar: تبرع طبي

# donationForEducation
source: Educational Donation
ar: تبرع تعليمي

# donationForFood
source: Food Donation
ar: تبرع غذائي

# donationForHousing
source: Housing Donation
ar: تبرع سكني

# donationForEmergency
source: Emergency Donation
ar: تبرع طوارئ

source: Urgent Need
ar: حاجة عاجلة

source: Moderate Need
ar: حاجة متوسطة

source: Low Priority
ar: أولوية منخفضة

source: Critical Condition
ar: حالة حرجة

source: Good Condition
ar: حالة جيدة

source: Fair Condition
ar: حالة مقبولة

source: Excellent Condition
ar: حالة ممتازة

# newCondition
source: New
ar: جديد

# usedCondition
source: Used
ar: مستعمل

# refurbishedCondition
source: Refurbished
ar: مجدد

source: Donation Terminology
ar: مصطلحات التبرع

source: Charitable Giving
ar: العطاء الخيري

source: Social Responsibility
ar: المسؤولية الاجتماعية

source: Community Support
ar: دعم المجتمع

source: Helping Others
ar: مساعدة الآخرين

# makingDifference
source: Making a Difference
ar: إحداث فرق

source: Spreading Kindness
ar: نشر اللطف

source: Giving Back
ar: رد الجميل

source: Sharing is Caring
ar: المشاركة اهتمام

source: Together We Can Help
ar: معاً يمكننا المساعدة

source: Every Donation Counts
ar: كل تبرع مهم

source: Your Kindness Matters
ar: لطفك مهم

# buildingBetterCommunity
source: Building a Better Community
ar: بناء مجتمع أفضل

source: Connecting Hearts and Hands
ar: ربط القلوب والأيدي

source: Bridging the Gap
ar: سد الفجوة

source: United in Giving
ar: متحدون في العطاء

source: Compassion in Action
ar: الرحمة في العمل

source: Hope for All
ar: أمل للجميع

source: Lending a Hand
ar: مد يد العون

source: Caring Community
ar: مجتمع مهتم

source: Generous Hearts
ar: قلوب سخية

source: Kindness Ripples
ar: تموجات اللطف

source: Sharing Hope
ar: مشاركة الأمل

source: Light in Darkness
ar: نور في الظلام

source: Warmth in Coldness
ar: دفء في البرد

source: Strength in Unity
ar: قوة في الوحدة

source: Love in Action
ar: الحب في العمل

source: Graceful Giving
ar: العطاء الكريم

source: Blessed to Give
ar: مبارك في العطاء

source: Grateful to Receive
ar: ممتن للاستلام

source: Humble Service
ar: خدمة متواضعة

source: Dignified Help
ar: مساعدة كريمة

source: Respectful Support
ar: دعم محترم

source: Cultural Sensitivity
ar: الحساسية الثقافية

source: Islamic Values
ar: القيم الإسلامية

source: Zakat
ar: زكاة

source: Sadaqah
ar: صدقة

source: Khair
ar: خير

source: Barakah
ar: بركة

source: Ajr
ar: أجر

source: Hasanat
ar: حسنات

source: Birr
ar: بر

source: Ihsan
ar: إحسان

source: Takaful
ar: تكافل

source: Silaturrahim
ar: صلة الرحم

source: Ukhuwah
ar: أخوة

source: Taawun
ar: تعاون

source: Rahma
ar: رحمة

source: Hikmah
ar: حكمة

source: Sabr
ar: صبر

source: Shukr
ar: شكر

source: Tawakkul
ar: توكل

source: Ikhlas
ar: إخلاص

source: Taqwa
ar: تقوى

source: Iman
ar: إيمان

source: Islam
ar: إسلام

source: Field required
ar: هذا الحقل مطلوب

source: Field too short
ar: هذا الحقل قصير جداً

source: Field too long
ar: هذا الحقل طويل جداً

source: Invalid format
ar: تنسيق غير صحيح

source: Invalid input
ar: إدخال غير صحيح

source: Please enter valid value
ar: يرجى إدخال قيمة صحيحة

source: Please select option
ar: يرجى اختيار خيار

source: Please enter text
ar: يرجى إدخال نص

source: Please enter number
ar: يرجى إدخال رقم

source: Number too small
ar: الرقم صغير جداً

source: Number too large
ar: الرقم كبير جداً

source: Must be positive number
ar: يجب أن يكون رقماً موجباً

source: Must be whole number
ar: يجب أن يكون رقماً صحيحاً

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# emailInvalid
source: Email is invalid
ar: البريد الإلكتروني غير صحيح

# emailTooLong
source: Email is too long
ar: البريد الإلكتروني طويل جداً

source: Email already exists
ar: البريد الإلكتروني موجود بالفعل

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# passwordTooWeak
source: Password is too weak
ar: كلمة المرور ضعيفة

# passwordMustContainUppercase
source: Password must contain an uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير

# passwordMustContainLowercase
source: Password must contain a lowercase letter
ar: يجب أن تحتوي كلمة المرور على حرف صغير

# passwordMustContainNumber
source: Password must contain a number
ar: يجب أن تحتوي كلمة المرور على رقم

# passwordMustContainSpecialChar
source: Password must contain a special character
ar: يجب أن تحتوي كلمة المرور على رمز خاص

# nameRequired
source: Name is required
ar: الاسم مطلوب

# nameTooShort
source: Name is too short (minimum 2 characters)
ar: الاسم قصير جداً (حرفان على الأقل)

# nameTooLong
source: Name is too long (maximum 50 characters)
ar: الاسم طويل جداً (50 حرف كحد أقصى)

# nameInvalidCharacters
source: Name contains invalid characters
ar: الاسم يحتوي على أحرف غير صحيحة

# phoneRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# phoneInvalid
source: Phone number is invalid
ar: رقم الهاتف غير صحيح

# phoneTooShort
source: Phone number is too short
ar: رقم الهاتف قصير جداً

# phoneTooLong
source: Phone number is too long
ar: رقم الهاتف طويل جداً

# phoneAlreadyExists
source: Phone number already exists
ar: رقم الهاتف موجود بالفعل

# locationRequired
source: Location is required
ar: الموقع مطلوب

# locationTooLong
source: Location is too long (maximum 100 characters)
ar: الموقع طويل جداً (100 حرف كحد أقصى)

# titleRequired
source: Title is required
ar: العنوان مطلوب

# titleTooLong
source: Title is too long (maximum 100 characters)
ar: العنوان طويل جداً (100 حرف كحد أقصى)

# descriptionRequired
source: Description is required
ar: الوصف مطلوب

# descriptionTooLong
source: Description is too long (maximum 1000 characters)
ar: الوصف طويل جداً (1000 حرف كحد أقصى)

# categoryRequired
source: Category is required
ar: الفئة مطلوبة

# categoryInvalid
source: Invalid category
ar: فئة غير صحيحة

# conditionRequired
source: Condition is required
ar: الحالة مطلوبة

# conditionInvalid
source: Invalid condition
ar: حالة غير صحيحة

# quantityRequired
source: Quantity is required
ar: الكمية مطلوبة

# quantityInvalid
source: Invalid quantity
ar: كمية غير صحيحة

# quantityTooSmall
source: Quantity is too small (minimum 1)
ar: الكمية صغيرة جداً (1 على الأقل)

# quantityTooLarge
source: Quantity is too large (maximum 1000)
ar: الكمية كبيرة جداً (1000 كحد أقصى)

# imageRequired
source: Image is required
ar: الصورة مطلوبة

# imageTooLarge
source: Image size is too large (maximum 5MB)
ar: حجم الصورة كبير جداً (5 ميجابايت كحد أقصى)

# imageFormatInvalid
source: Invalid image format
ar: تنسيق الصورة غير صحيح

# tooManyImages
source: Too many images (maximum 5)
ar: عدد كبير جداً من الصور (5 كحد أقصى)

# messageRequired
source: Message is required
ar: الرسالة مطلوبة

# messageTooShort
source: Message is too short (minimum 5 characters)
ar: الرسالة قصيرة جداً (5 أحرف على الأقل)

# messageTooLong
source: Message is too long (maximum 500 characters)
ar: الرسالة طويلة جداً (500 حرف كحد أقصى)

# dateRequired
source: Date is required
ar: التاريخ مطلوب

# dateInvalid
source: Invalid date
ar: تاريخ غير صحيح

# dateTooEarly
source: Date is too early
ar: التاريخ مبكر جداً

# dateTooLate
source: Date is too late
ar: التاريخ متأخر جداً

# timeRequired
source: Time is required
ar: الوقت مطلوب

# timeInvalid
source: Invalid time
ar: وقت غير صحيح

source: Connection error
ar: خطأ في الاتصال

source: Server error
ar: خطأ في الخادم

source: Timeout error
ar: انتهت مهلة الاتصال

source: Unknown error
ar: خطأ غير معروف

source: Operation failed
ar: فشلت العملية

source: Operation cancelled
ar: تم إلغاء العملية

source: Access Denied
ar: تم رفض الوصول

source: Unauthorized
ar: غير مخول

source: Forbidden
ar: محظور

source: Not found
ar: غير موجود

source: Already exists
ar: موجود بالفعل

source: Conflict error
ar: خطأ في التضارب

source: Validation error
ar: خطأ في التحقق

source: Processing error
ar: خطأ في المعالجة

source: Upload error
ar: خطأ في الرفع

source: Download error
ar: خطأ في التحميل

source: Save error
ar: خطأ في الحفظ

source: Load error
ar: خطأ في التحميل

source: Delete error
ar: خطأ في الحذف

source: Update error
ar: خطأ في التحديث

source: Create error
ar: خطأ في الإنشاء

source: Login error
ar: خطأ في تسجيل الدخول

source: Logout error
ar: خطأ في تسجيل الخروج

source: Registration error
ar: خطأ في التسجيل

source: Authentication error
ar: خطأ في المصادقة

source: Session expired
ar: انتهت صلاحية الجلسة

source: Account locked
ar: الحساب مقفل

source: Account disabled
ar: الحساب معطل

source: Account not verified
ar: الحساب غير موثق

source: Email not verified
ar: البريد الإلكتروني غير موثق

source: Phone not verified
ar: رقم الهاتف غير موثق

source: Verification required
ar: التحقق مطلوب

source: Verification failed
ar: فشل التحقق

source: Verification expired
ar: انتهت صلاحية التحقق

source: Code required
ar: الرمز مطلوب

source: Code invalid
ar: رمز غير صحيح

source: Code expired
ar: انتهت صلاحية الرمز

source: Too many attempts
ar: محاولات كثيرة جداً

source: Rate limit exceeded
ar: تم تجاوز حد المعدل

source: Quota exceeded
ar: تم تجاوز الحصة

source: Storage quota exceeded
ar: تم تجاوز حصة التخزين

source: Bandwidth exceeded
ar: تم تجاوز عرض النطاق الترددي

source: Service unavailable
ar: الخدمة غير متاحة

source: Maintenance mode
ar: وضع الصيانة

source: Feature disabled
ar: الميزة معطلة

source: Upgrade required
ar: الترقية مطلوبة

source: Subscription required
ar: الاشتراك مطلوب

source: Subscription expired
ar: انتهت صلاحية الاشتراك

source: Payment required
ar: الدفع مطلوب

source: Payment failed
ar: فشل الدفع

source: Insufficient funds
ar: أموال غير كافية

source: Card declined
ar: تم رفض البطاقة

source: Card expired
ar: انتهت صلاحية البطاقة

source: Invalid card
ar: بطاقة غير صحيحة

source: Operation successful
ar: نجحت العملية

source: Save successful
ar: نجح الحفظ

source: Update successful
ar: نجح التحديث

source: Delete successful
ar: نجح الحذف

source: Create successful
ar: نجح الإنشاء

source: Upload successful
ar: نجح الرفع

source: Download successful
ar: نجح التحميل

source: Login successful
ar: نجح تسجيل الدخول

source: Logout successful
ar: نجح تسجيل الخروج

source: Registration successful
ar: نجح التسجيل

source: Verification successful
ar: نجح التحقق

source: Password changed
ar: تم تغيير كلمة المرور

source: Profile updated
ar: تم تحديث الملف الشخصي

source: Settings updated
ar: تم تحديث الإعدادات

source: Preferences updated
ar: تم تحديث التفضيلات

source: Notification sent
ar: تم إرسال الإشعار

# messageSent
source: Message sent successfully
ar: تم إرسال الرسالة

source: Request sent
ar: تم إرسال الطلب

source: Invitation sent
ar: تم إرسال الدعوة

source: Confirmation sent
ar: تم إرسال التأكيد

source: Reminder sent
ar: تم إرسال التذكير

source: Report generated
ar: تم إنشاء التقرير

source: Backup created
ar: تم إنشاء النسخة الاحتياطية

source: Data exported
ar: تم تصدير البيانات

source: Data imported
ar: تم استيراد البيانات

source: Sync completed
ar: اكتملت المزامنة

source: Task completed
ar: اكتملت المهمة

source: Process completed
ar: اكتملت العملية

source: Installation completed
ar: اكتمل التثبيت

source: Configuration completed
ar: اكتمل التكوين

source: Setup completed
ar: اكتمل الإعداد

source: Migration completed
ar: اكتملت الهجرة

source: Optimization completed
ar: اكتمل التحسين

source: Analysis completed
ar: اكتمل التحليل

source: Scan completed
ar: اكتمل الفحص

source: Test completed
ar: اكتمل الاختبار

source: Validation completed
ar: اكتمل التحقق

source: Processing completed
ar: اكتملت المعالجة

source: Calculation completed
ar: اكتمل الحساب

source: Generation completed
ar: اكتمل الإنشاء

source: Conversion completed
ar: اكتمل التحويل

source: Compression completed
ar: اكتمل الضغط

source: Decompression completed
ar: اكتمل إلغاء الضغط

source: Encryption completed
ar: اكتمل التشفير

source: Decryption completed
ar: اكتمل فك التشفير

# overviewSubtitle
source: Monitor your platform performance and activity
ar: راقب أداء المنصة والنشاط

# usersSubtitle
source: Manage registered users and their permissions
ar: إدارة المستخدمين المسجلين وصلاحياتهم

# requestsSubtitle
source: Review and manage donation requests
ar: مراجعة وإدارة طلبات التبرع

# donationsSubtitle
source: Track and manage all donations
ar: تتبع وإدارة جميع التبرعات

# analyticsSubtitle
source: View detailed analytics and reports
ar: عرض التحليلات والتقارير التفصيلية

# settingsSubtitle
source: Configure system settings and preferences
ar: تكوين إعدادات النظام والتفضيلات

# adminDashboardWelcome
source: Welcome to the admin dashboard
ar: مرحباً بك في لوحة تحكم المدير

source: Coming soon...
ar: قريباً...

source: Refresh
ar: تحديث

source: New user registered
ar: تم تسجيل مستخدم جديد

source: hour ago
ar: ساعة مضت

source: Recent Users
ar: المستخدمون الأخيرون

source: No Users Found
ar: لا يوجد مستخدمون

# noUsersFoundMessage
source: No users found in the system
ar: لم يتم العثور على مستخدمين في النظام

# noDonationsFound
source: No Donations
ar: لا توجد تبرعات

# noDonationsFoundMessage
source: No donations found in the system
ar: لم يتم العثور على تبرعات في النظام

source: No Pending Requests
ar: لا توجد طلبات معلقة

# noPendingRequestsMessage
source: All requests have been processed
ar: تمت معالجة جميع الطلبات

source: No recent activity
ar: لا يوجد نشاط حديث

# newUserRegisteredActivity
source: New user registered
ar: تم تسجيل مستخدم جديد

# newDonationPostedActivity
source: New donation posted
ar: تم نشر تبرع جديد

# newRequestSubmittedActivity
source: New request submitted
ar: تم تقديم طلب جديد

source: joined as
ar: انضم كـ

source: donated
ar: تبرع بـ

source: requested help
ar: طلب المساعدة

source: Unknown time
ar: وقت غير معروف

# justNowTime
source: Just now
ar: الآن

source: weeks ago
ar: أسابيع مضت

source: Claimed
ar: تم المطالبة به

source: Anonymous
ar: مجهول

source: Someone
ar: شخص ما

source: Platform Information
ar: معلومات المنصة

source: System Settings
ar: إعدادات النظام

source: Platform Name
ar: اسم المنصة

source: Version
ar: الإصدار

source: Support Email
ar: البريد الإلكتروني للدعم

source: Max Upload Size
ar: الحد الأقصى لحجم التحميل

source: Session Timeout
ar: مهلة الجلسة

source: API Version
ar: إصدار API

source: Database Status
ar: حالة قاعدة البيانات

source: Total Transactions
ar: إجمالي المعاملات

source: Available Donations
ar: التبرعات المتاحة

source: Donors
ar: المتبرعون

source: Receivers
ar: المستقبلون

# totalUsersLabel
source: Total Users
ar: إجمالي المستخدمين

# pendingRequestsCount
source: Pending Requests
ar: الطلبات المعلقة

source: Pending Donations
ar: التبرعات المعلقة

source: Approve Donation
ar: الموافقة على التبرع

source: Reject Donation
ar: رفض التبرع

# areYouSureApprove
source: Are you sure you want to approve "{title}"?
ar: هل أنت متأكد من الموافقة على "{title}"؟

# rejecting
source: Rejecting: "{title}"
ar: رفض: "{title}"

source: Rejection Reason
ar: سبب الرفض

# provideRejectionReason
source: Provide a reason for rejection
ar: يرجى تقديم سبب الرفض

# pleaseProvideRejectionReason
source: Please provide a rejection reason
ar: يرجى تقديم سبب الرفض

source: Reject
ar: رفض

source: Rejected
ar: مرفوض

source: Donation approved successfully
ar: تمت الموافقة على التبرع بنجاح

source: Failed to approve donation
ar: فشل في الموافقة على التبرع

source: Donation rejected successfully
ar: تم رفض التبرع بنجاح

source: Failed to reject donation
ar: فشل في رفض التبرع

source: Failed to load pending donations
ar: فشل في تحميل التبرعات المعلقة

source: No Pending Donations
ar: لا توجد تبرعات معلقة

# noPendingDonationsMessage
source: All donations have been reviewed
ar: تمت مراجعة جميع التبرعات

source: Donor Name
ar: اسم المتبرع

source: Submitted On
ar: تم التقديم في

source: Actions
ar: الإجراءات

source: Pending Review
ar: قيد المراجعة

source: Approval Status
ar: حالة الموافقة
